# 需求 : 交换 x, y 的值
x = 10
y = 20

# 方式一 : 临时变量
# temp = x
# x = y
# y = temp

# 方式二 : + - - (自增运算符 ++ 自减运算符 --)
# js有，前自增 ++1 以及后自增++。 但是python没有，只有一种自增方式
# x = x + y # x = 30
# y = x - y # y = 10
# x = x - y # x = 20

# 方式三 : Python 语言特有的交换语法, 其它语言没有该语法
# x, y = y, x

# 方式四 : Python的交换语法，在底层是位运算 - 异或操作 
# (异或操作的口诀: 相同为0, 不同为1)
x = x ^ y
y = x ^ y
x = x ^ y
print(f'{x = }, {y = }')

# 具体实现思路如下：
# 在python 中 三个单引号是多行注释
''' 一个字节表示数据
十进制   二进制
10      0000 1010
20      0001 0100
'''
#  x = x ^ y  异或操作结果是 30 
''' 一个字节表示数据
10    0000 1010
20    0001 0100
-----------------
      0001  1110 x=30
'''
#  y = x ^ y 异或操作结果是 10
''' 一个字节表示数据
30    0001 1110
20    0001 0100
-----------------
      0000  1010 y=10
'''
# x = x ^ y 异或操作结果是 20
''' 一个字节表示数据
30   0001  1110
10   0000  1010
-----------------
     0001  0100  x=20

'''

print('===其他的交换云算法==' )

# << 左移: 每移动一位, 相当于 * 2
n = 10
n = n << 1 # 相当于 10 * 2 = 20
print(f'{n = }')

# >> 右移: 每移动一位, 相当于 // 2
m = 10
m = m >> 1 # 相当于 10 // 2 = 20
print(f'{m = }')

# & 按位与: 全 1 为 1
a = 10
b = 7
'''
10 0000 1010
7  0000 0111
-----------------
   0000 0010 结果为: 2
'''
c = a & b
print(f'{c = }')
# | 按位或 : 有 1 就 1
'''
10 0000 1010
7  0000 0111
-----------------
   0000 1111 结果为: 15
'''
d = a | b
print(f'{d = }')

#### 结果

n = 20
m = 5
c = 2
d = 15