# 需求 : 交换 x, y 的值
x = 10
y = 20

# 方式一 : 临时变量
# temp = x
# x = y
# y = temp
# 方式二 : + - - (自增运算符 ++ 自减运算符 --)
# x = x + y # x = 30
# y = x - y # y = 10
# x = x - y # x = 20
# 方式三 : Python 语言特有的交换语法, 其它语言没有该语法
# x, y = y, x
# 方式四 : 位运算 - 异或操作 (口诀: 相同为0, 不同为1)
''' 一个字节表示数据
10 0000 1010
20 0001 0100
'''
''' 一个字节表示数据
10 0000 1010
20 0001 0100
-----------------
0001 1110 x=30
'''
x = x ^ y
''' 一个字节表示数据
30 0001 1110
20 0001 0100
-----------------
0000 1010 y=10
'''
y = x ^ y
''' 一个字节表示数据
30 0001 1110
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
交换两个变量的数值 Python
7
# 其它位运算法操作 :
10 0000 1010
-----------------
0001 0100 x=20
'''
x = x ^ y
print(f'{x = }, {y = }')

# << 左移 : 每移动一位, 相当于 * 2
n = 10
n = n << 1
print(f'{n = }')
# >> 右移 : 每移动一位, 相当于 // 2
m = 10
m = m >> 1
print(f'{m = }')
# & 按位与 : 全 1 为 1
a = 10
b = 7
'''
10 0000 1010
7 0000 0111
-----------------
0000 0010 结果为: 2
'''
c = a & b
print(f'{c = }')
# | 按位或 : 有 1 就 1
'''
10 0000 1010
7 0000 0111
-----------------
0000 1111 结果为: 15
'''
d = a | b
print(f'{d = }')